---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsEnergyAnalysisViewRbeMode
source: html/8872634c-7f90-dc22-b308-49443dcbfa1a.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsEnergyAnalysisViewRbeMode Property

"Show Room Bounding Elements Dimmed and Underlay"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsEnergyAnalysisViewRbeMode { get; }
```